from fish_audio_sdk import Session
import store
x = store.getApiKeyByPlatform("fishaudio")
print(x)
session = Session(x)
# modelID = {
#     "guodegang":"7c66db6e457c4d53b1fe428a8c547953",
#     "yangshi":"59cb5986671546eaa6ca8ae6f29f6d22",
#     "dongxuelian":"7af4d620be1c4c6686132f21940d51c5",
#     "AD_XUEJIE":"7f92f8afb8ec43bf81429cc1c9199cb1",
# }
# TEXT = '''今有童子，性聪慧，好遐思，尤爱宇宙之奇。一日，童子于梦中忽见一巨物，形似大鹏，闪耀银光，其上有“中国制造”四字，光芒夺目。趋近观之，乃知其为宇宙飞船也。
# 此飞船外观，宏伟绝伦。其形如鹏，展翼若云。船体通身银白，坚如精钢，似由天工巧匠精心锻造。船头尖锐，似利箭之锋，可破虚空。船身修长，线条流畅，宛若游龙。其上刻有神秘符文，似蕴含天地之奥秘。船尾喷射出蓝色火焰，如巨龙吐息，气势磅礴。
# 飞船之内，奇妙非凡。仪器密布，闪烁光芒，皆为中国制造之精良器具。有一导航之器，名曰北斗。其精准无比，可引飞船于浩瀚宇宙中畅行无阻。又有战机数架，名曰鸾鸟。其形如凤，威不可犯。此战机装备精良，可御外敌于万里之外。童子见之，惊叹不已。
# 此飞船乃南天门计划之一部分。南天门计划者，国之重策也。旨在探索宇宙，保卫家国。其集科技之大成，展国威于苍穹。童子有幸，得登此船。
# 俄而，飞船启动，如离弦之箭，冲入云霄。童子但觉身体一轻，仿佛飘于云端。飞船穿越大气层，进入太空。童子望向窗外，只见星辰璀璨，如宝石般点缀于天幕之上。地球渐行渐远，如蓝色明珠，美丽绝伦。
# 飞船依北斗导航，前行于宇宙之间。途中，遇一星体，其上有奇异之光。童子欲往探究，然惧未知之险。此时，鸾鸟战机腾空而起，护卫飞船。战机如神鸟翱翔，气势恢宏。童子见之，心中大安。
# 游毕，飞船返航。童子归而告众人，皆惊叹不已。自此，童子立志，当努力学习，将来为中国制造之辉煌、南天门计划之成功贡献己力。
# 呜呼！中国制造之宇宙飞船，乃国之重器，科技之结晶。其有北斗导航之精准，鸾鸟战机之威武，南天门计划之宏伟。童子之游，显中国航天之成就，展民族未来之希望。愿吾国之科技日益精进，宇宙探索之路愈行愈远。'''
# with open("r.mp3", "wb") as f:
#     for chunk in session.tts(TTSRequest(reference_id=modelID["yangshi"],text=TEXT)):
#         f.write(chunk)